In [6]:
import pandas as pd

# from list
s1  = pd.Series([10,20,30,40])
print(s1)

# With custom index 
s2 = pd.Series([100,200,300], index = ['A','B','C'])
print(s2)

0    10
1    20
2    30
3    40
dtype: int64
A    100
B    200
C    300
dtype: int64

In [10]:
sales = pd.Series([1200,1500,1100], index = ["East", "West", "South"])
print("South sales:", sales["West"])

South sales: 1500

In [13]:
#from dictionary

data = {
    "Name" : ["Jeo", "Miller", "james"],
    "Age" : [21,32,12],
    "Department" : ["cse","it","hr"]}

df = pd.DataFrame(data)
print(df)

     Name  Age Department
0     Jeo   21        cse
1  Miller   32         it
2   james   12         hr

In [14]:
# list of dictionaries
data = [
    {"Name":"praveen","age":21,"dept":"Cse"},
    {"Name":"koushik","age":22,"dept":"mech"},
    ]

df = pd.DataFrame(data)
print(df)

      Name  age  dept
0  praveen   21   Cse
1  koushik   22  mech

In [17]:
df.iloc[0]

Name    praveen
age          21
dept        Cse
Name: 0, dtype: object

In [18]:
df.loc[0]

Name    praveen
age          21
dept        Cse
Name: 0, dtype: object

In [19]:
df["Name"]

0    praveen
1    koushik
Name: Name, dtype: object

In [22]:
employees = {
    "EMPID":[101,102,103],
    "Salary":[50000, 60000, 70000],
    "Department":["IT","HR","Finance"]}
df = pd.DataFrame(employees)
#Filter the data
print(df[df["Department"] == "IT"])

   EMPID  Salary Department
0    101   50000         IT

In [29]:
# Add a column
df["Bonus"] = df["Salary"] * 0.10
# Update column
df["Salary"] = df["Salary"] + 5000
#drop column
#df.drop("Bonus",axis = 1, inplace = True)
print(df)

   EMPID  Salary Department    Bonus
0    101   85000         IT   8000.0
1    102   95000         HR   9000.0
2    103  105000    Finance  10000.0

In [30]:
df.describe() # focus on numerical columns

       EMPID    Salary    Bonus
count    3.0       3.0      3.0
mean   102.0   95000.0   9000.0
std      1.0   10000.0   1000.0
min    101.0   85000.0   8000.0
25%    101.5   90000.0   8500.0
50%    102.0   95000.0   9000.0
75%    102.5  100000.0   9500.0
max    103.0  105000.0  10000.0

In [31]:
df.info() # to know number of columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EMPID       3 non-null      int64
 1   Salary      3 non-null      int64
 2   Department  3 non-null      object
 3   Bonus       3 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 228.0+ bytes

In [33]:
# working with csv file
# Read from csv

import pandas as pd
df = pd.read_csv("employee.csv")
print(df)

# Write to CSV:
df.to_csv("employee.csv", index = False)
df

   EmpID    Name  Age Department  Salary
0    101    John   28         IT   50000
1    102    Emma   34         HR   60000
2    103    Ryan   29    Finance   55000
3    104  Sophia   25  Marketing   52000

   EmpID    Name  Age Department  Salary
0    101    John   28         IT   50000
1    102    Emma   34         HR   60000
2    103    Ryan   29    Finance   55000
3    104  Sophia   25  Marketing   52000

In [34]:
df[(df["Salary"]>50000) & (df["Department"] == "Finance")]

   EmpID  Name  Age Department  Salary
2    103  Ryan   29    Finance   55000

In [40]:
df = pd.read_csv("sales.csv")
df.to_csv("sales.csv", index = False)
df

         Date Region Product  Units_Sold  Unit_Price
0  2024-05-01   East  Laptop           5         700
1  2024-05-01   West   Phone          10         300
2  2024-05-02   East  Laptop           6         700
3  2024-05-02   West   Phone           8         300

In [46]:
# print top 5 records
print(df.head())
# print top 3 records
print(df.head(3))
# last 3 records
print(df.tail(2))

         Date Region Product  Units_Sold  Unit_Price
0  2024-05-01   East  Laptop           5         700
1  2024-05-01   West   Phone          10         300
2  2024-05-02   East  Laptop           6         700
3  2024-05-02   West   Phone           8         300
         Date Region Product  Units_Sold  Unit_Price
0  2024-05-01   East  Laptop           5         700
1  2024-05-01   West   Phone          10         300
2  2024-05-02   East  Laptop           6         700
         Date Region Product  Units_Sold  Unit_Price
2  2024-05-02   East  Laptop           6         700
3  2024-05-02   West   Phone           8         300

In [44]:
# total sales by region
print(df.groupby("Region")["Units_Sold"].sum())

Region
East    11
West    18
Name: Units_Sold, dtype: int64

In [59]:
import pandas as pd
import numpy as np

data = { "NAME":["Alice",np.nan,"Charlie","Koushik"],
         "Age":[25,np.nan,30, 28],
         "Department": ["HR","Finance",np.nan,"IT"],
         "Salary":[10000,20000,30000,np.nan]}

df = pd.DataFrame(data)
df

      NAME   Age Department   Salary
0    Alice  25.0         HR  10000.0
1      NaN   NaN    Finance  20000.0
2  Charlie  30.0        NaN  30000.0
3  Koushik  28.0         IT      NaN

In [60]:
df.isnull() # True for missing cells
#df.isnull().sum() # Count missing values per column

    NAME    Age  Department  Salary
0  False  False       False   False
1   True   True       False   False
2  False  False        True   False
3  False  False       False    True

In [61]:
df.isnull().sum() # Count missing values per column

NAME          1
Age           1
Department    1
Salary        1
dtype: int64

In [66]:
df.fillna({'NAME':'Name miss','Age':'null','Department':'Dept miss','Salary':'null'})

        NAME   Age Department   Salary
0      Alice  25.0         HR  10000.0
1  Name miss  null    Finance  20000.0
2    Charlie  30.0  Dept miss  30000.0
3    Koushik  28.0         IT     null

In [67]:
#drop rows with miss values
df.dropna()

    NAME   Age Department   Salary
0  Alice  25.0         HR  10000.0

In [68]:
df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [69]:
df = pd.read_csv("sales.csv")
df.to_csv("sales.csv", index = False)
df

         Date Region Product  Units_Sold  Unit_Price
0  2024-05-01   East  Laptop           5         700
1  2024-05-01   West   Phone          10         300
2  2024-05-02   East  Laptop           6         700
3  2024-05-02   West   Phone           8         300

In [71]:
sales = { 
    "Date":["2024-01-01","2024-01-02","2024-01-03","2024-01-04"],
    "Region":["East","West",np.nan,"South"],
    "Units_Sold": [10,np.nan,15,12],
    "Unit_Price":[300,250,400,np.nan]}

df = pd.DataFrame(sales)

# 1. Detect missing
print(df.isnull().sum())

# 2. Fill Unit_Price with mean
df.fillna({"Unit_Price": df["Unit_Price"].mean()}, inplace = True)

# 3. Drop rows where Region is missing
df.dropna(subset=["Region"],inplace = True)
print(df)

Date          0
Region        1
Units_Sold    1
Unit_Price    1
dtype: int64
         Date Region  Units_Sold  Unit_Price
0  2024-01-01   East        10.0  300.000000
1  2024-01-02   West         NaN  250.000000
3  2024-01-04  South        12.0  316.666667

In [72]:
df[df["Units_Sold"]>10]

         Date Region  Units_Sold  Unit_Price
3  2024-01-04  South        12.0  316.666667

In [ ]:
# Multiple Aggregations

import pandas as pd
df = pd